DROP DATABASE IF EXISTS testdb_sk49;
CREATE DATABASE testdb_sk49 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;
USE testdb_sk49;

DROP TABLE IF EXISTS INSECTS;

CREATE TABLE INSECTS(
        ORDER_NAME CHAR(16),
		ORDER_CODE CHAR(16),
        FAMILIY_NAME CHAR(20),
        FAMILIY_CODE CHAR(16),
        GENUS_NAME CHAR(20),
        GENUS_CODE CHAR(16),
        INSECT_NAME CHAR(30),
        INSECT_CODE CHAR(16) PRIMARY KEY,
        LATIN_NAME CHAR(80),
        FOOD TEXT,
        AREA TEXT
        ) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝉科', 'C15204000000', '蚱蝉属', 'C15204005000', '黑蚱蝉', 'C15204005005', 'Cryptotympana atrata Fabricius', '杨、柳、榆、女贞、竹、苦楝、水杉、悬铃木、桑、三叶橡胶、柚木及多种果树、山楂、樱花、枫杨、苹果', '惠山区、滨湖区；赣榆区、连云区；泰兴、靖江；宿迁泗阳、沭阳、宿城区、宿豫区；射阳、盐都、大丰；镇江市；斜桥社区、苏州高新区、吴中区、常熟、昆山、吴江区、太仓；徐州市：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝉科', 'C15204000000', '蜷姑属', 'C15204035000', '蟪蛄', 'C15204035010', 'Platypleura kaempferi', '桑、泡桐、茶、杨、柳、悬铃木，毛白杨、梨、桃、柳', '惠山区、滨湖区、宜兴；金湖县；灌云县、灌南、连云区；浦口区、雨花台区、玄武区、秦淮区、栖霞区；如皋；泰兴、靖江；宿迁沭阳、宿豫区、泗洪、泗阳；射阳、建湖、阜宁、大丰、亭湖区；高邮县、宝应县、广陵区、江都区、扬州市开发区、瘦西湖；镇江市；常熟、吴中区、昆山、苏州高新区、太仓、吴江；徐州市：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝉科', 'C15204000000', '寒蝉属', 'C15204020000', '蒙古寒蝉', 'C15204020005', 'Meimuna mongolica', '槐、刺槐、杨柳、桑、合欢、板栗', '惠山区、滨湖区、宜兴；金湖县、青浦区；赣榆区；建邺区、江宁区、栖霞区、溧水区、六合区；靖江、姜堰；泗阳县、沭阳、宿城区、泗洪、宿豫区；建湖、亭湖区、东台；高邮县、宝应县、广陵区、江都区、扬州市开发区、瘦西湖、邗江区、仪征市；镇江市；常熟、吴中区、昆山、苏州高新区、太仓、吴江；徐州市：开发区、泉山区、丰县、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝽科', 'C15408000000', '菜蝽属', 'C15408115000', '菜蝽', 'C15408115005', 'Eurydema dominulus (Scopoli)', '刺槐、蔬菜作物', '徐州市：云龙区、泉山区、开发区、丰县、
沛县、铜山区、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝽科', 'C15408000000', '茶翅蝽属', 'C15408150000', '茶翅蝽', 'C15408150000', 'Halyomorpha picus Fabricius', '麻栎、油茶、柳、油桐，构树、山枣、臭椿', '宜兴；青浦区、金湖县；灌南、连云区；浦口区、雨花区、江宁区、六合区；常熟；靖江、泰兴；泗阳；阜宁、盐都、大丰、东台、射阳；宝应县、广陵区、江都区、扬州市开发区、瘦西湖、仪征市；镇江市；徐州市：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、贾汪区 (全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝽科', 'C15408000000', '条蝽属', 'C15408140000', '赤条蝽', 'C15408140005', 'Graphosoma rubrolineata', '栎、榆、黄波罗、杨、山枣、桃', '秦淮区；苏州市；徐州市：云龙区、鼓楼区、开发区、沛县*、铜山区、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝽科', 'C15408000000', '麻皮蝽属', 'C15408105000', '麻皮蝽', 'C15408105005', 'Erthesina fullo (Thunberg)', '油桐、油茶、柿、梧桐、泡桐、
杨、桃、杏、槐、樱花、构树、女贞、悬铃木', '宜兴；常州市；淮阴区、金湖县；浦口区、六合区、玄武区、栖霞区；靖江；宿迁沭阳、宿城区、宿豫区、泗洪；阜宁、盐都、大丰、射阳、东台；江都区、宝应县、扬州市开发区、瘦西湖；镇江市；常熟、吴中区、昆山、吴江、苏州高新区、太仓、丰泾村；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蝽科', 'C15408000000', '硕蝽属', 'C15409015000', '硕蝽', 'C15409015010', ' Eurostus validus Dallas', '马尾松、梧桐、板栗、乌桕等', '连云区；栖霞区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '兜蝽科', 'C15410000000', '皱蝽属', 'C15410010000', '大皱蝽', 'C15410010005', 'Cyclopelta obscura', '香荚兰、葫芦科植物叶片', '赣榆区；溧水区、栖霞区、江宁区、六合区、玄武区；宿迁宿豫区；扬州市开发区、瘦西湖；徐州市：鼓楼区、泉山区、开发区、丰县、铜山区、睢宁县、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蛾蜡蝉科', 'C15104000000', '碧蛾蜡蝉属', 'C15104005000', '碧蛾蜡蝉', 'C15104005005', 'Geisha distinctissima（Walker）', '桑、茶、油茶、乌桕及多种果树，
海桐、梨、桃、柿、桑、李、
杏、苹果、葡萄、白蜡、无花果、大叶黄杨', '宜兴；常州市；建邺区；姜堰；宿豫区；阜宁、东台；江都区；镇江市；太仓、昆山、苏州高新区；徐州市：沛县、睢宁县、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '负子蝽科', 'C15428000000', '鳖负蝽属(田鳖属)', 'C15428005000', '大田鳖', 'C15428005005', 'Lethocerus deyrolli Vuillefroy', '肉食性', '泰兴；泗阳县；建湖、大丰、亭湖区；宝应县;高淳区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '广蜡蝉科', 'C15105000000', '广翅蜡蝉属', 'C15105015000', '柿广翅蜡蝉', 'C15105015045', 'Ricania sublimata', '柿树、香樟、女贞、紫薇等、桃、
杨、苦楝、构树、臭椿、栾树、石楠、
红枫、刺槐、火棘、国槐、枇杷、大叶黄杨、
紫薇、五角枫', '常州市；金湖县、青浦区；灌南；雨花区、浦口区；如皋、海门；泰兴、姜堰；泗阳县、宿城区、宿豫区；高邮县、宝应县、广陵区、江都区、扬州市开发区、瘦西湖；镇江市；苏州市；徐州市：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '广蜡蝉科', 'C15105000000', '疏广蜡蝉属', 'C15105005000', '透翅疏广蜡蝉', 'C15105005005', 'Euricania clara', '苹果、桃、李、柑桔、油茶、茶、苦楝、乌桕、板栗、桑等', '宿迁泗阳；浦口区、雨花区；如皋、海门；泰兴、姜堰；高邮县、广陵区、江都区、扬州市开发区、瘦西湖、宝应县；灌南；射阳、盐都、阜宁、大丰、东台；镇江市');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '蜡蝉科', 'C15102000000', '斑衣蜡蝉属', 'C15102015000', '斑衣蜡蝉', 'C15102015005', 'Lycorma delicatula', '臭椿、洋槐、榆、杨、苦楝、
桃、刺槐、花椒、女贞、青桐、香椿、五角枫、石榴', '惠山区；常州市；金湖县、青浦区；赣榆区、连云区；浦口区、六合区、栖霞区、建邺区、江宁区、鼓楼区、高淳区、玄武区；如皋、海门；迎春东路；宿城区、宿豫区；射阳、盐都、建湖、大丰；宝应县、广陵区、扬州市开发区、瘦西湖、仪征市；镇江市；苏州市；徐州市：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '珠蚧科', 'C15331000000', '履绵蚧属', 'C15331005000', '草履蚧', 'C15331005010', 'Drosicha corpulenta (Kuwana)', '杨、樟、石楠、女贞、山核桃、榆等、
梨、紫薇、法国冬青、悬铃木、
红叶石楠、金边黄杨、珊瑚树、紫叶李', '灌南；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市）');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '网蝽科', 'C15418000000', '方翅网蝽属', 'C15418003000', '悬铃木方翅网蝽', 'C15418003005', 'Corythucha ciliata', '悬铃木，苹果', '灌南；浦口区；宿迁沭阳；射阳；镇江市；徐州市：泉山区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区 (全市)');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '象蜡蝉科', 'C15106000000', '象蜡蝉属', 'C15106005000', '中华象蜡蝉', 'C15106005010', 'Dictyophara sinica', '桑树、柑橘、构树', '灌南');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '叶蝉科', 'C15206000000', '叶蝉属', 'C15206040000', '大青叶蝉', 'C15206040005', 'Cicadella viridis', '桑、梨、杨、柳、洋槐等、桃、李、苹果', '宜兴；浦口区、雨花区；宿迁泗阳、宿城区、宿豫区；响水、盐都、大丰、阜宁；江都区、扬州市开发区、瘦西湖；镇江市；常熟；徐州市：云龙区、开发区、丰县、沛县*、铜山区、睢宁县、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '叶蝉科', 'C15206000000', '小绿叶蝉属', 'C15206070000', '小绿叶蝉', 'C15206070025', 'Jacobiasca formosana', '桑、茶、梨、桃、李、杏、葡萄、柑桔、杨梅、木芙蓉等、紫叶李', '雨花区\秦淮区\玄武区；徐州市：丰县、沛县、铜山区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '缘蝽科', 'C15401000000', '普缘蝽属', 'C15401135000', '刺肩普缘蝽', 'C15401135015', 'Plinachtus dissimilis', '卫矛', '宝应县；东台；徐州市：铜山区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '缘蝽科', 'C15401000000', '棘缘蝽属', 'C15401030000', '稻棘缘蝽', 'C15401030015', 'Cletus punctiger Dallas', '茶、栾树、构树、柚子，桑、苹果', '宜兴；赣榆区；六合区、江宁区、栖霞区、浦口区、雨花台区；常熟；宿城区；大丰；广陵、江都区、扬州市开发区、瘦西湖；镇江市；徐州市：鼓楼区、开发区、沛县、铜山区、邳州市、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '缘蝽科', 'C15401000000', '蜂缘蝽属', 'C15403040000', '点蜂缘蝽', 'C15403040010', 'Riptortus pedestris(Fabricius)', '刺槐，梨、苹果', '宜兴；金湖县；栖霞区、六合区、江宁区、浦口区、雨花台区；常熟；姜堰；响水、建湖、盐都；高邮县、宝应县、广陵区、江都区、扬州市开发区、瘦西湖；镇江市；徐州市：鼓楼区、泉山区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('半翅目', 'C15000000000', '缘蝽科', 'C15401000000', '普缘蝽属', 'C15401135000', '钝肩普缘蝽(钝角普缘蝽)', 'C15401135010', 'Plinachtus bicoloripes Scott', '榆树、杨树、卫矛科植物，大叶黄杨', '灌南；江都区；常州市；射阳、盐都、阜宁；徐州市：铜山区、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '斑蝶科', 'C22355000000', '斑蝶属', 'C22355005000', '虎斑蝶', 'C22355005010', 'Danaus genutia (Cramer)', '萝藦科植物', '南京市溧水区、江宁区、六合区、玄武区、栖霞区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '斑蝶科', 'C22355000000', '斑蝶属', 'C22355005000', '金斑蝶', 'C22355005005', 'Danaus chrysippus Linnaeus', '伞形花科植物', '溧水区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '斑蝶科', 'C22355000000', '带锦斑蛾属', 'C22302060000', '玉带斑蛾', 'C22302060030', 'Pidorus atratus Butter', '不详', '连云区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '斑蛾科', 'C22302000000', '帆锦斑蛾属', 'C22302035000', '重阳木锦斑蛾', 'C22302035005', 'Histia rhodope Cramer', '重阳木', '常州市；赣榆；如皋；靖江、西郊公园、生态园、泰兴、姜堰；盐都区、射阳、阜宁、东台、亭湖区；扬州市开发区、瘦西湖、宝应县；镇江市；盛泽村、常熟、吴江区、苏州高新区、昆山市、太仓市；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县*、铜山区、睢宁县、邳州市、新沂市、贾汪区（全市）');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '尺蛾科', 'C22331000000', '金星尺蛾属', 'C22331010000', '大叶黄杨尺蛾', 'C22331010005', 'Calospilos suspecta Warren', '大叶黄杨', '金湖县；雨花台区、浦口区；盐都区、射阳、阜宁、建湖；云龙区、丰县、沛县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '尺蛾科', 'C22331000000', '四星尺蛾属', 'C22331375000', '四星尺蛾', 'C22331375010', 'Ophthalmitisirrorataria (Bremer & Grey)?', '桑、李、梨、枣、苹果、海棠、鼠李', '铜山区(赵疃林场)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '尺蛾科', 'C22331000000', '蜻蜓尺蛾属', 'C22331145000', '小蜻蜓尺蛾', 'C22331145005', 'Cystidia couaggaria Guenée', '蔷薇科植物', '浦口区；高邮县、宝应县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '刺蛾科', 'C22301000000', '扁刺蛾属', 'C22301125000', '扁刺蛾', 'C22301125010', 'Thosea sinensis Walker', '杨、杮、紫叶李、枣、梨、桃、李、柳、榆、杏、樟、桑、樱花、月季、樱桃、苦楝、苹果、乌桕、枫杨、枇杷、海棠、樱桃、银杏、紫藤、紫薇、紫荆、泡桐、三角枫、枙子花、悬铃木、白玉兰、蓖麻等30科43种植物', '东海；泰兴；宿迁泗阳、沭阳、宿城区、泗洪、宿豫；江都区；云龙区、鼓楼区、开发区、丰县、沛县、铜山区、睢宁县、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '刺蛾科', 'C22301000000', '绿刺蛾属', 'C22301090000', '褐边绿刺蛾', 'C22301090015', 'Latoria consocia Walker', '杨树、枣、梨、杏、桃、李、柿、栗、苹果、海棠、樱桃、山楂、核桃等果树，杨、榆、柳、枫、槭、桑、梧桐、白蜡、紫荆、刺槐、乌桕、冬青、悬铃木等', '常州市；赣榆区、连云区；如皋；常熟；泰兴；宿迁泗阳、沭阳、宿城区、泗洪、宿豫区；镇江市；吴中区、吴江区、苏州高新区、昆山市、太仓市、御窑社区、常熟；云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全徐州市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '刺蛾科', 'C22301000000', '黄刺蛾属', 'C22301070000', '黄刺蛾', 'C22301070005', 'Cnidocampa flavescens（Walker）', '杨、柿、桃、李、杏、桑、枣、梨、柳、榆、青桐、枫杨、枇杷、乌桕、樱桃、山楂、刺槐、梧桐、板栗、苦楝、苹果、石榴、核桃、五角枫、悬铃木重阳木、三角枫、大叶黄杨', '金湖县；赣榆区；如皋；泰兴；宿迁泗阳、宿豫区；江都区、扬州市开发区、瘦西湖；吴中区、太仓市、御窑；云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区（全徐州市）');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '大蚕蛾科', 'C22338000000', '尾大蚕蛾属', 'C22338005000', '红尾大蚕蛾', 'C22338005020', 'Actias dubernardi Oberthur', '柳、杉等', '镇江市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '大蚕蛾科', 'C22338000000', '尾大蚕蛾属', 'C22338005000', '绿尾大蚕蛾', 'C22338005025', 'Actias selene ningpoana Felder', '山茱萸、杜仲、杨、柳、樟树、枫香、乌桕、榆、板栗、海棠、樱花、木槿、乌桕、悬铃木、胡桃科等', '连云区；栖霞区、高淳区、六合区；泰兴；大丰、东台；徐州泉山区、丰县、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '灰灯蛾属', 'C22345075000', '八点灰灯蛾', 'C22345075010 ', 'Creatonotus transiens (Walker)', '柑桔、桑叶、茶等', '浦口区；泰兴；镇江市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '缘灯蛾属', 'C22345005000', '红缘灯蛾', 'C22345005005', 'Amsacta lactinea (Cramer)', '梅花、木槿、乌桕、悬铃木、桑、杨、柳、桐、槐、柿、栗、苹果、连翘、紫穗槐等等', '连云区；泰兴；开发区、沛县*、铜山区、睢宁县、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '花布丽灯蛾属', 'C22345055000', '花布灯蛾', 'C22345055005', 'Camptoloma interiorata(Walker)', '栓皮栎、槲栎、板栗、柳等', '连云区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '白蛾属', 'C22345105000', '美国白蛾', 'C22345105005', 'Hyphantria cunea (Drury)', '杨、柳、桑、柿、榆、桃、白蜡、构树、木槿、火炬树、君迁子、泡桐、苹果、马褂木、芦苇、大叶黄杨', '金湖县、青浦区；盐都、大丰；江宁区、浦口区；宿迁泗阳、沭阳、宿城区、泗洪、宿豫区；盐都区、射阳、阜宁、建湖、响水、亭湖区；江都区、宝应县；云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区（全徐州市）');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '污灯蛾属', 'C22345170000', '强污灯蛾', 'C22345170050', 'Spilarctia robusta (Leech)', '月季、桑', '镇江市；徐州开发区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '污灯蛾属', 'C22345170000', '人纹污灯蛾', 'C22345170045', 'Spilarctia subcarnea (Walker)', '桑、木槿、杨、榆、槐、蔷薇、月季、碧桃、十字花科蔬菜、豆类等', '金湖县；灌南、连云区；浦口区；如皋；泰兴；盐都区、射阳、建湖；宝应县；镇江市；常熟、渭南村；开发区、丰县、沛县*、铜山区、睢宁县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '灯蛾科', 'C22345000000', '美苔蛾属', 'C22345120000', '优美苔蛾', 'C22345120015', 'Miltochrista striata (Bremer et Grey，1852)', '不详', '连云区；泰兴');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '毒蛾科', 'C22348000000', '柏毒蛾属', 'C22348075000', '侧柏毒蛾', 'C22348075005', 'Parocneria furva （Leech）', '侧柏', '海门；常熟；徐州泉山区、开发区、沛县*、铜山区、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '毒蛾科', 'C22348000000', '盗毒蛾属', 'C22348090000', '盗毒蛾(黄尾毒蛾) ', 'C22348090020', 'Porthesia similis (Fueszly) ', '樱桃、杨、柳、枣、柿、李、桑、梨、桃、杏、栎、泡桐、梧桐、桂花、海棠、蔷薇、山楂、苹果、石楠、刺槐等', '开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '毒蛾科', 'C22348000000', '雪毒蛾属', 'C22348100000', '柳毒蛾', 'C22348100020', 'Stilprotia salicis (Linnaeus)', '杨、柳、栎树、白蜡', '连云区；射阳、建湖、响水；徐州丰县、沛县、铜山区、邳州市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '毒蛾科', 'C22348000000', '茸毒蛾属', 'C22348030000', '线茸毒蛾', 'C22348030040', 'Dasychira grotei Moore', '桃、桂花、杨、柳、泡桐、悬铃木、榉、榆、朴树、樱花', '泰州泰兴；宿迁泗阳；盐都区；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '粉蝶科', 'C22358000000', '粉蝶属', 'C22358060000', '菜粉蝶', 'C22358060010', ' Pieris rapae (Linnaeus)', '十字花科、豆科、蔷薇科等', '常州市；金湖县、青浦县；赣榆区、连云区；浦口区、江宁区、高淳区；振兴村、新牧院、启扬高速、泰山公园、福音游园、天德湖公园、天普园林苗圃、东石羊村、靖江、简阳；宿迁沭阳；盐都区、响水、阜宁、东台、建湖；宝应县、广陵区、扬州市开发区、瘦西湖；镇江市、常熟');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '凤蝶属', 'C22359040000', '碧凤蝶', 'C22359040005', 'Papilio bianor Cramer', '漆树、（樗叶、光叶）花椒、山椒、吴茱萸', '宜兴；金湖县；连云区；六合区、玄武区、江宁区、栖霞区、浦口区、溧水区、雨花台区、鼓楼区；宿迁沭阳、宿城区；响水；宝应县；镇江市；常熟、苏州高新区；徐州开发区、丰县、沛县*、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '凤蝶属', 'C22359040000', '柑橘凤蝶', 'C22359040060', 'Papilio xuthus Linnaeus', '柑橘、（樗叶、光叶）花椒、枸杞、黄檗、吴茱萸、山椒等', '宜兴；金湖县、盱眙县；赣榆区、连云区；江宁区、鼓楼区、浦口区、栖霞区、溧水区、建邺区、秦淮区、六合区；如皋、海门；宿迁沭阳；盐都区、东台；镇江市；御窑社区、吴中区、太仓；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '凤蝶属', 'C22359040000', '金凤蝶', 'C22359040025', 'Papilio machaon Linnaeus', '樟、楠、花椒(82名录P235)；伞形花科植物(茴香、柴胡、芹菜、胡萝卜)的花蕾、嫩叶和嫩芽梢', '东台；宜兴；建邺区、江宁区；西夏村；徐州鼓楼区、泉山区、开发区、沛县、铜山区、睢宁县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '凤蝶属', 'C22359040000', '蓝凤蝶', 'C22359040055', 'Papilio protenor Cramer', '芸香科植物', '金湖县；栖霞区马群街道；镇江市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '麝凤蝶属', 'C22359010000', '麝凤蝶', 'C22359010005', 'Byasa alcinous Klug', '灌木', '常州市；淮阴区、金湖县；赣榆、连云区；浦口区、江宁区；姜堰；宿迁沭阳；盐都、阜宁；江都区、宝应县、扬州市开发区、瘦西湖；镇江市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '丝带凤蝶属', 'C22359050000', '丝带凤蝶', 'C22359050005', 'Sericinus montelus Grey', '马兜铃、青木香', '宜兴；赣榆区、连云区；六合区、溧水区；姜堰；响水；江都区；镇江市；常熟；徐州云龙区、鼓楼区、泉山区、开发区、沛县*、铜山区、睢宁县、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '凤蝶属', 'C22359040000', '玉带凤蝶', 'C22359040045', 'Papilio polytes Linnaeus', '枸杞、（光叶）花椒、山椒', '宜兴；常州市；灌南；江宁区、鼓楼区、六合区；如皋；泰兴、靖江；宿迁沭阳；盐都区、东台；江都区、宝应县；镇江市；御窑社区、吴中区、常熟、昆山市、太仓市、吴江；徐州开发区、沛县*、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '凤蝶科', 'C22359000000', '青凤蝶属', 'C22359020000', '樟青凤蝶', 'C22359020015', 'Graphium sarpedon Linnaeue', '樟树(香樟)、楠、肉桂', '宜兴；常州市；金湖县、洪泽县、盱眙县；连云区；栖霞区、玄武区、溧水区、江宁区、浦口区、建邺区、秦淮区；靖江、泰兴、百兴游园、姜堰；宿迁沭阳、宿城区；盐都区、射阳、阜宁、响水、建湖、亭湖区；广陵区、江都区、扬州市开发区、瘦西湖；镇江市；陆巷村、吴中区、昆山市、太仓市、常熟、吴江、浒关开发区；徐州鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '钩蛾科', 'C22330000000', '圆钩蛾属', 'C22330030000', '洋麻圆钩蛾', 'C22330030010', 'Cyclidia substigmaria substigmaria(Hübner)', '麻、洋麻', '金湖县；鼓楼区、江宁区、玄武区、栖霞区、高淳区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛀果蛾科', 'C22320000000', '蛀果蛾属', 'C22320010000', '桃小食心虫', 'C22320010005', 'Carposina niponensis Walsingham', '苹果、梨、杏、桃、李、梅、枣、山楂、木瓜', '丰县、睢宁县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛱蝶科', 'C22360000000', '红蛱蝶属', 'C22360210000', '大红蛱蝶', 'C22360210010', 'Vanessa indica Herbst', '榆、榉、麻、苎麻、葎草', '宜兴；常州市；赣榆区；浦口区、栖霞区；泰兴；徐州丰县、沛县*、睢宁县、邳州市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛱蝶科', 'C22360000000', '尾蛱蝶属', 'C22360190000', '二尾蛱蝶', 'C22360190005', 'Polyura narcaea Hewitson', '山槐、黄檀', '江宁区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛱蝶科', 'C22360000000', '脉蛱蝶属', 'C22360095000', '黑脉蛱蝶', 'C22360095010', 'Hestina assimilis (Linnaeus)', '朴树', '锡山区；常州市；淮阴区、洪泽县、盱眙县；连云区；栖霞区、江宁区、溧水区、六合区、鼓楼区、玄武区、雨花台区；宿迁沭阳、宿城区；陆巷村、苏州高新区、吴中区、常熟、昆山、吴江区、太仓；徐州铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛱蝶科', 'C22360000000', '钩蛱蝶属', 'C22360185000', '黄钩蛱蝶', 'C22360185010', 'Polygonia caureum(Linnaeus)', '桑、梨、榆科、葎草、亚麻科、柑橘', '宜兴；常州市；金湖县、盱眙县、淮阴区；赣榆区；栖霞区、玄武区、建邺区、溧水区、浦口区、雨花台区、江宁区；百姓游园、天普园林苗圃、靖江、泰兴；宿迁沭阳、宿城区；响水、射阳、盐都、东台、大丰；广陵区、江都区、扬州市开发区、瘦西湖；镇江市；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县*、铜山区、邳州市、睢宁县、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '蛱蝶科', 'C22360000000', '闪蛱蝶属', 'C22360010000', '柳紫闪蛱蝶', 'C22360010005', 'Atatura ilia (Denis et Schiffermuller)', '柳树、杨树', '宜兴；赣榆区；六合区、雨花台区；宿迁宿豫区；响水、射阳、阜宁；镇江市；常熟、吴江、昆山、苏州高新区；徐州开发区、沛县*、铜山区、睢宁县、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '枯叶蛾科', 'C22336000000', '松毛虫属', 'C22336025000', '马尾松毛虫', 'C22336025040', 'Dendrolimus punctatus Walker', '马尾松等', '常熟、吴中区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '螟蛾科', 'C22327000000', '绢野螟属', 'C22326080000', '黄杨绢野螟', 'C22326080040', 'Diaphania perspectalis (Walker)', '大叶黄杨、小叶黄杨、瓜子黄杨、雀舌黄杨、尖叶黄杨、冬青、卫矛', '宜兴；常州市；金湖县；东海、连云区；浦口区；如皋；常熟、莲花庄村；泰兴；宿城区、泗洪、宿豫区；射阳、盐都、阜宁、建湖、响水、大丰；江都区、宝应县、扬州市开发区、瘦西湖、邗江区、仪征市；镇江市；云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区（全市）');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '螟蛾科', 'C22327000000', '蛀螟属', 'C22326060000', '桃蛀螟', 'C22326060005', 'Conogethes punctiferalis (Guenée)', '桃、杏、柿、山楂、梨、臭椿、苹果、石榴、樱桃、枇杷、板栗，大豆、玉米、棉花、向日葵', '锡山区、宜兴；金湖县、青浦县；浦口区；如皋、海门；泰兴；宿迁泗阳、宿城区、宿豫区；建湖、大丰、东台；广陵区、江都区；镇江市；常熟；云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区（全市）');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '螟蛾科', 'C22327000000', '瘤丛螟属', 'C22327100000', '樟巢螟', 'C22327100015', 'Orthaga achatina', '樟树', '苏州市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '螟蛾科', 'C22327000000', '缀叶丛螟属', 'C22327065000', '缀叶丛螟', 'C22327065005', 'Locastra muscosalis Walker', '核桃、木橑、黄连木', '泰兴；开发区、铜山区、睢宁县、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '豆天蛾属', 'C22341055000', '豆天蛾', 'C22341055010', 'Clanis bilineata', '大豆、刺槐', '金湖县；东海、连云区；如皋、海门；泰兴；宿城区、泗洪；阜宁、东台盐都区；吴中区、吴江区、苏州高新区、昆山市、太仓市；徐州开发区、丰县、沛县、铜山区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '白薯天蛾属', 'C22341090000', '甘薯天蛾', 'C22341090005', 'Agrius convolvuli', '赤豆、甘薯', '金湖县；连云区；浦口区、六合区；如皋；宿迁宿豫区；江都区；东台；镇江市；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '红天蛾属', 'C22341150000', '红天蛾', 'C22341150010', 'Pergesa elpenorlewisi', '茜草、忍冬、葡萄、半夏、凤仙花、千屈菜', '常州市；浦口区、高淳区；如皋、海门；泰兴；泗阳县；阜宁、东台；江都区、邗江区、仪征市；镇江市；徐州丰县、睢宁县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '目天蛾属', 'C22341185000', '蓝目天蛾', 'C22341185030', 'Smerinthus planus Walker', '杨、柳、桃、李、榆、樱桃、苹果、海棠、核桃、葡萄、樱花', '赣榆、连云区；浦口区；如皋；泰兴；泗阳县、沭阳；阜宁；仪征；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '葡萄天蛾属', 'C22341025000', '葡萄天蛾', 'C22341025005', 'Arnpelophaga rubiginosa Bremer et Grey ', '葡萄', '高淳区；泰兴；金湖县；镇江市；常熟；徐州沛县*、邳州市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '斜纹天蛾属', 'C22341200000', '雀纹天蛾', 'C22341200015', 'Theretra japonica (Orza)', '爬山虎、常春藤、麻叶绣球、葡萄、野葡萄、白粉藤', '浦口区、溧水区；如皋；泰兴；泗阳县、沭阳县、宿豫区；阜宁；江都区、宝应县；金湖县;邗江区；镇江市；吴中区、吴江区、苏州高新区、昆山市、太仓市、连云区；东台；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '天蛾科', 'C22341000000', '霜天蛾属', 'C22341165000', '霜天蛾', 'C22341165010', 'Psilogramma menephron(Gramer.)', '女贞、柳、泡桐、梧桐、丁香、樟树、桂花、楸树、苦楝、牡荆、白蜡、悬铃木、栀子花、金叶女贞等', '连云区；高淳区、建邺区、鼓楼区、浦口区、六合区；泰兴；泗阳县；射阳、阜宁、东台；江都区、宝应县、邗江区、仪征市；徐州云龙区、开发区、丰县、沛县*、铜山区、睢宁县、新沂市、贾汪区');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '夜蛾科', 'C22346000000', '变色夜蛾属', 'C22346420000', '变色夜蛾', 'C22346420005', 'Enmonodia vespertili Fabricius', '合欢、紫藤、紫薇、桃、梨', '常州市；如皋；宿迁泗阳；沛县*、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '夜蛾科', 'C22346000000', '旋夜蛾属', 'C22346290000', '臭椿皮蛾', 'C22346290005', 'Eligma narcissus （Cramer，1775）', '臭椿、香椿、红椿、桃和李', '宜兴；海门；泗阳县；扬州市开发区、瘦西湖；江都区；常州市；宿迁沭阳；响水、盐都区、阜宁、射阳；常熟、车渡村、浦口区；江都区；云龙区、鼓楼区、泉山区、开发区、丰县、沛县*、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '夜蛾科', 'C22346000000', '豹夜蛾属', 'C22346715000', '胡桃豹夜蛾', 'C22346715005', 'Sinna extrema (Walker)', '枫杨、胡桃、泡桐、山核桃,成虫吸食杜鹃、箭叶旋花、华东泡桐等花蜜，核桃、柳树等', '常州市；江宁区、浦口区、雨花台区、玄武区；常熟；响水、东台；广陵区、仪征市、扬州市开发区、瘦西湖；镇江市；云龙区、沛县*、铜山区、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '夜蛾科', 'C22346000000', '斜纹夜蛾属', 'C22346870000', '斜纹夜蛾', 'C22346870005', 'Prodenia litura (Fabricius)', '杨、柳、榆、柿、桑，枣、李、桃、梨、泡桐、枇杷、海棠、苹果、石榴、银杏、刺槐、紫薇等；棉、小麦、高粱、玉米、甘薯、豆类、瓜类等400多种植物，成虫喜食糖醋和发酵物，十字花科', '锡山区；常州市；东海；六合区、浦口区；如皋；泰兴；盐都、东台；高邮县、广陵区、江都区；旺巷村、吴江区、苏州高新区、昆山市、太仓市、常熟；开发区、丰县、沛县*、铜山区、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '夜蛾科', 'C22346000000', '旋目夜蛾属', 'C22346725000', '旋目夜蛾', 'C22346725010', 'Speiredonia retorta (Linnaeus）', '合欢、泡桐，成虫吸食成熟的梨、桃、杏、李、枇杷、苹果、葡萄、番茄、木瓜等果汁，柑橘、苹果、黑荆', '金湖县；连云区；建邺区、浦口区、鼓楼区；镇江市；沛县、铜山区、新沂市');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '舟蛾科', 'C22342000000', '扇舟蛾属', 'C22342015000', '分月扇舟蛾', 'C22342015010', 'Clostera anastomosis（Linnaeus，1758）', '杨、柳', '如皋；泰兴；宿迁泗阳；江都区、扬州市开发区、瘦西湖');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '舟蛾科', 'C22342000000', '美舟蛾属', 'C22342285000', '核桃美舟蛾', 'C22342285005', 'Uropyia meticulodina (Oberthür)', '胡桃、胡桃楸', '泰兴；常熟');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '舟蛾科', 'C22342000000', '二尾舟蛾属', 'C22342010000', '杨二尾舟蛾', 'C22342010005', 'Cerura menciana Moore', '杨、柳', '宜兴；灌南；宿迁泗阳、宿城区；大丰、射阳、亭湖区；徐州开发区、丰县、沛县*、铜山区、睢宁县');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '舟蛾科', 'C22342000000', '扇舟蛾属', 'C22342015000', '杨扇舟蛾', 'C22342015005', 'Clostera anachoreta (Denis et Schiffermüller, 1775)', '杨、柳', '金湖县；如皋；泰兴、靖江；江都区；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鳞翅目', 'C22000000000', '舟蛾科', 'C22342000000', '拟皮舟蛾属', 'C22342135000', '杨小舟蛾', 'C22342135005', 'Micromelalopha troglodyta (Graeser)', '杨、柳', '金湖县；如皋；泰兴、靖江；建湖、大丰；广陵区；徐州云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '花金龟科', 'C21102000000', '星花金龟属', 'C21102055000', '白星花金龟', 'C21102055005', 'Protaetia brevitarsis Lewis', '桃、李、梨、柳、榆、
海棠、樱花、葡萄、苹果分布广泛', '金湖县；赣榆区、连云区；雨花、浦口、高淳；姜堰；宿迁泗阳、宿城区、宿豫区；建湖、阜宁、射阳、东台；扬州市开发区、瘦西湖、宝应县；镇江市；太仓市、昆山市、宅基村、吴江、高新区、吴中区；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '花金龟科', 'C21102000000', '鹿花金龟属', 'C21102020000', '黄粉鹿花金龟', 'C21102020020', 'Dicranocephalus wallichi', '杨梅、构树等', '宜兴；连云区；镇江市');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '吉丁甲科', 'C21301000000', '脊吉丁属', 'C21301095000', '日本脊吉丁', 'C21301095005', 'Chalcophora japonica(Gory)', 'None', '宜兴');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '金龟科', 'C21109000000', '洁蜣螂属', 'C21109005000', '犀角粪金龟', 'C21109005005', 'Catharsius molossus Linnaeus', '兽粪', '徐州：睢宁县');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '裸角天牛属', 'C21701825000', '薄翅锯天牛(中华薄翅天牛) ', 'C21701825005', 'Megopis sinica sinica White', '杨、柳、桑、榆、苹果', '徐州：云龙区、鼓楼区、开发区、丰县、沛县、铜山区、睢宁县(有雄虫)、邳州市、新沂市');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '锹甲科', 'C21108000000', '扁锹甲属', 'C21108045000', '中华大扁锹', 'C21108045005', 'Dorcus titanus platymelus', '杨、栎，柳，桃', '灌南；金湖县；玄武区、溧水区、栖霞区、六合区、江宁区、鼓楼区、雨花台区；泰兴、靖江；泗阳县；镇江市、吴江、太仓、昆山、苏州高新区、吴中区滨湖区、锡山区、宜兴；冯官村、姜堰；宿迁沭阳、宿城区、宿豫区；响水、盐都区、大丰、阜宁、射阳、建湖；宝应县、高邮县、广陵区、江都区、扬州市开发区、瘦西湖、邗江区\张家港、常熟、泗阳');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '星天牛属', 'C21701065000', '光肩星天牛', 'C21701065030', 'Anoplophora glabripennis Motschulsky,1853', '悬铃木、柳、杨、栾树', '灌云；溧水区、浦口区、江宁区；海门；靖江、口岸生态园、泰兴；大丰；镇江市；吴中区、盛泽村、高新区、太仓市、常熟市、昆山市、吴江、张家港；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '粒肩天牛属', 'C21701080000', '桑天牛', 'C21701080005', 'Apriona germari(Hope)', '桑树、构树，杨、柳、柘树、
女贞、樱桃、无花果', '金湖县；灌云、连云区；浦口区、江宁区、六合区；海门、如皋；泰兴；泗阳县、泗洪、宿豫区；建湖、东台、阜宁、盐都；邗江区、仪征市；镇江市；吴江区、太仓市、昆山市、吴中区、苏州高新区；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '杉天牛属', 'C21701690000', '双条杉天牛', 'C21701690005', 'Semanotus bifasciatus bifasciatus (Motschulsky) ', '侧柏、扁柏、罗汉柏', '徐州云龙区、沛县、铜山区');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '墨天牛属', 'C21701445000', '松墨天牛', 'C21701445005', 'Monochamus alternatus Hope, 1842', '马尾松', '宜兴；建邺区；赣榆区、连云区；泰兴；吴中区');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '颈天牛属', 'C21701095000', '桃红颈天牛', 'C21701095005', 'Aromia bungii Fald', '栎、榆、桃、杏等果树、杏、樱花、樱桃', '滨湖区；灌云、连云区；浦口区、玄武区；泰兴；盐都区、射阳；常州市；广陵区；镇江市；高新区、张家港市、车渡村、太仓市、昆山市、常熟市、吴中区、吴江；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '星天牛属', 'C21701065000', '星天牛', 'C21701065010', 'Anoplophora chinensis Forster,1771', '杨、柳、桑、榆、法桐、刺槐、
桃、苦楝、香椿、悬铃木、栾树、青桐', '滨湖区、宜兴；常州市；金湖县；灌云、连云区；浦口区、玄武区、雨花区、江宁区、溧水区、鼓楼区、六合区；如皋；靖江、泰兴；泗阳县、沭阳、泗洪、宿豫区；盐都区、射阳、大丰、东台；镇江市；高新区、张家港市、车渡村、太仓市、昆山市、常熟市、吴江、吴中区；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区(全市)');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '粒肩天牛属', 'C21701080000', '锈色粒肩天牛', 'C21701080010', 'Apriona swainsoni(Hope)', '国槐、柳、黄檀', '灌云；如皋；阜宁；徐州：泉山区、丰县、沛县、铜山区');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '天牛科', 'C21701000000', '白条天牛属', 'C21701130000', '云斑白条天牛', 'C21701130015', 'Batocera horsfieldi Hope', '核桃、白蜡、榆、杨树、柳树', '灌南、灌云、东海、连云区；滨湖区；金湖县；浦口区、雨花区、建邺区、江宁区、六合区；海门、如皋；东石羊村、溱湖公园、动物园、靖江、泰兴、振兴村；泗阳县、沭阳、宿城区、泗洪、宿豫区；建湖、东台、阜宁；高邮县、广陵区、江都区、邗江区、仪征市；高新区、吴中区、张家港市、常熟、太仓、吴江区');
INSERT INTO INSECTS VALUES ('鞘翅目', 'C21000000000', '叶甲科', 'C21703000000', '圆叶甲属', 'C21703280000', '柳蓝叶甲', 'C21703280010', 'plagiodera versicolora ', '垂柳、杨树，旱柳、桑', '金湖县；灌南县；江宁区；海门；姜堰、靖江；宿迁泗阳、沭阳、宿城区、宿豫区；盐都区、阜宁、东台、大丰、建湖；高邮县、宝应县、广陵区、江都区、扬州市开发区、瘦西湖；镇江市；徐州：云龙区、鼓楼区、泉山区、开发区、丰县、沛县、铜山区、睢宁县、邳州市、新沂市、贾汪区');

